Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/runsc/go-httpd/target_count_8/repeat_19/2.txt
2020/01/20 12:15:14 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8002/
2020/01/20 12:15:44 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 32044 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8002
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      32044
Failed requests:        0
Total transferred:      4582292 bytes
HTML transferred:       833144 bytes
Requests per second:    1068.13 [#/sec] (mean)
Time per request:       93.622 [ms] (mean)
Time per request:       0.936 [ms] (mean, across all concurrent requests)
Transfer rate:          149.16 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   8.2      3     116
Processing:     1   88  76.5     60    1011
Waiting:        0   87  76.4     60    1010
Total:          1   93  76.8     66    1017
Percentage of the requests served within a certain time (ms)
  50%     66
  66%     98
  75%    137
  80%    182
  90%    218
  95%    230
  98%    247
  99%    260
 100%   1017 (longest request)
2020/01/20 12:15:44 Matched stat line [Connect:        0    6   8.2      3     116 Connect 0 6 8.2 3 116]
2020/01/20 12:15:44 Matched stat line [Processing:     1   88  76.5     60    1011 Processing 1 88 76.5 60 1011]
2020/01/20 12:15:44 Matched stat line [Waiting:        0   87  76.4     60    1010 Waiting 0 87 76.4 60 1010]
2020/01/20 12:15:44 Matched stat line [Total:          1   93  76.8     66    1017 Total 1 93 76.8 66 1017]
2020/01/20 12:15:44 Matched percentline [  50%     66 50 66]
2020/01/20 12:15:44 Matched percentline [  66%     98 66 98]
2020/01/20 12:15:44 Matched percentline [  75%    137 75 137]
2020/01/20 12:15:44 Matched percentline [  80%    182 80 182]
2020/01/20 12:15:44 Matched percentline [  90%    218 90 218]
2020/01/20 12:15:44 Matched percentline [  95%    230 95 230]
{"connect":{"max":116,"mean":6,"median":3,"min":0,"stdDev":8.199999809265137},"percentiles":{"100":1017,"50":66,"66":98,"75":137,"80":182,"90":218,"95":230,"98":247,"99":260},"processing":{"max":1011,"mean":88,"median":60,"min":1,"stdDev":76.5},"total":{"max":1017,"mean":93,"median":66,"min":1,"stdDev":76.80000305175781},"waiting":{"max":1010,"mean":87,"median":60,"min":0,"stdDev":76.4000015258789}}
2020/01/20 12:15:44 Matched percentline [  98%    247 98 247]
2020/01/20 12:15:44 Matched percentline [  99%    260 99 260]
2020/01/20 12:15:44 Matched percentline [ 100%   1017 100 1017]